Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/mobility-omegat.tmx
Source language: en_us
Languages: pt_br

source: Create New Key Pair Alias
pt_br: Criar novo par de chaves alias

source: Export Keystore into Emulator platform
pt_br: Exportar repositório de chaves na plataforma do emulador

source: Keystore &File:
pt_br: &Arquivo de repositório de chaves:

source: Ke&ys:
pt_br: Chav&es:

source: &Unlock...
pt_br: &Desbloquear...

source: Manage Keystores
pt_br: Gerenciar repositório de chaves

source: Not available
pt_br: Não disponível

source: Invalid key pair alias
pt_br: Par de chaves alias inválida

source: Key pair is locked
pt_br: Par de chaves está bloqueada

source: Subject
pt_br: Objetivo

source: Issuer
pt_br: Emissor

source: Valid
pt_br: Válido

source: The key subject is already installed in the platform as key #{1}.
pt_br: O objetivo chave já está instalado na plataforma como chave #{1}.

source: Delete file
pt_br: Excluir arquivo

source: For exporting key into the platform, keystore {0} must be copied to {1}, but target file already exists.
pt_br: Para exportar chave numa plataforma, repositório de chaves {0} deve ser copiado para {1}, mas o arquivo destino já existe.

source: Do you want to continue and overwrite target file?
pt_br: Deseja continuar e escrever no arquivo destino?

source: Cannot delete file {0}.
pt_br: Não pode excluir arquivo {0}.

source: Cancelling key export.
pt_br: Cancelando chave de exportação.

source: I/O error while copying file {0} to {1}.
pt_br: Erro de I/O ao copiar arquivo {0} para {1}.

source: Are you sure you want to delete key #{0} from {1}?
pt_br: Realemtne deseja excluir chave #{0} de {1}?

source: Confirm Key Deletion
pt_br: Confirme exclusão da chave

source: Error while deleting key from the emulator.
pt_br: Erro ao excluir chave do emulador.

source: Not loaded
pt_br: Não carregado

source: Loading
pt_br: Carregando

source: No key
pt_br: Nenhuma chave

source: Error while loading keys
pt_br: Erro ao carregar chaves

source: Export Key into Java ME SDK/Platform/Emulator
pt_br: Exportar chave nos emulador/plataforma/SDK Java ME

source: Error while exporting key into emulator.
pt_br: Erro ao exportar chave para o emulador.

source: Key P&air Alias:
pt_br: P&ar de chaves alias:

source: &Platform:
pt_br: &Plataforma:

source: &Security Domain:
pt_br: Domínio de &segurança:

source: &Keys Registered in the Platform:
pt_br: &Chaves registradas na plataforma:

source: &Delete Key
pt_br: &Excluir chave

source: Export Keystore
pt_br: Exportar repositório de chaves

source: Empty keystore file name.
pt_br: Nome do arquivo de repositório de chaves vazio.

source: Keystore folder does not exist or is not a writable directory.
pt_br: Pasta do repositório de chaves não existe ou não está em diretório não autorizado a escrever.

source: Keystore file already exists.
pt_br: Arquivo de repositório de chaves já existe.

source: Keystore file is already added into manager.
pt_br: Arquivo de repositório de chaves já foi adicionado no gerenciador.

source: Keystore file does not exist.
pt_br: Arquivo de repositório de chaves não existe.

source: Keystore File (.jks, .ks, .keystore, .p12, .pkcs12)
pt_br: Arquivo de repositório de chaves (.jks, .ks, .keystore, .p12, .pkcs12)

source: Select Keystores Folder
pt_br: Selecionar pasta de repositório de chaves

source: Add Keystore
pt_br: Adicionar repositório de chaves

source: &Create a New Keystore
pt_br: &Criar um novo repositório de chaves

source: Keystore &Name:
pt_br: &Nome do repositório de chaves:

source: Keystore &Folder:
pt_br: &Pasta do repositório de chaves:

source: C&onfirm Password:
pt_br: C&onfirma senha:

source: &Add Existing Keystore
pt_br: &Adicionar repositório de chaves existente

source: K&eystore File:
pt_br: Arquivo de r&epositório de chaves:

source: New Keystore
pt_br: Novo repositório de chaves

source: Opens File Chooser for Keystore Folder.
pt_br: Abre um seletor de arquivos para pasta pasta de repositório de chaves.

source: Opens File Chooser for Keystore File.
pt_br: Abre um seletor de arquivos para arquivo de repositório de chaves.

source: Delete Key
pt_br: Excluir chave

source: Keystores Manager
pt_br: Gerenciador de repositório de chaves

source: &Add Keystore...
pt_br: &Adicionar repositório de chave...

source: &Unlock Keystore...
pt_br: &Desbloquear repositório de chave...

source: &Show Details
pt_br: &Mostrar detalhes

source: &Export...
pt_br: &Exportar...

source: &New...
pt_br: &Novo...

source: &Keystores:
pt_br: &Repositório de chaves:

source: Removes keystore from list.
pt_br: Remove repositório de chaves da lista.

source: Unlocks selected key.
pt_br: Debloqueia chave selecionada.

source: Exports selected key.
pt_br: Exporta chave selecionada.

source: Creates a new key.
pt_br: Cria uma nova chave.

source: Deletes selected key.
pt_br: Deleta chave selecionada.

source: Enter password for "{0}" keystore.
pt_br: Informar senha para repositório de chave "{0}".

source: Enter passphrase for "{0}" keyfile.
pt_br: Informar passphrase para arquivo chave "{0}".

source: Enter password for "{1}" key pair alias in the "{0}" keystore.
pt_br: Informar senha para o par de chaves alias "{1}" no repositório de chave "{0}".

source: Enter Password
pt_br: Informar senha

source: Failed to unlock the keystore.
pt_br: Falha ao desbloquear o repositório de chave.

source: You might have entered an invalid password.
pt_br: Voce deve ter informado uma senha inválida.

source: Failed to unlock the key.
pt_br: Falha ao desbloquear a chave.

source: Enter password for keystore
pt_br: Infomrar senha para repositório de chave

source: Enter password for opening keystore
pt_br: Informar senha para abrir repositório de chave

source: &Remember entered values for this session
pt_br: &Lembrar valores informados para esta sessão

source: Built-in Keystore
pt_br: Repositório de chave em construção

source: Fill Key Pair Alias field.
pt_br: Preencher campo par de chave alias.

source: Key pair alias already used in the keystore.
pt_br: Par de chave alias já utilizado no repositório de chave.

source: Fill at least one field in the Certificate Details section.
pt_br: Preencher pelo menos um campo na seção detalhes do certificado.

source: Create Key Pair
pt_br: Criar par de chave

source: Commo&n Name:
pt_br: Nome comu&m:

source: &Organization Unit:
pt_br: Unidade da &organização:

source: O&rganization Name:
pt_br: Nome da o&rganização:

source: &Locality Name:
pt_br: Nome da &localidade:

source: &State Name:
pt_br: Nome do e&stado:

source: &Country:
pt_br: &Cidade:

source: Con&firm Password:
pt_br: Con&firma senha:

source: Key Pair Alias
pt_br: Par de chaves alias

source: &Keystores
pt_br: &Repositório de chaves

source: This project configuration will not be deployed.
pt_br: Esta configuração de projeto não será implantado.

source: &Target Directory:
pt_br: Diretório des&tino:

source: Select Target Folder
pt_br: Selecioar pasta destino

source: Opens File Chooser for Target Directory.
pt_br: Abrir um seletor de arquivos para diretório destino.

source: File Copy
pt_br: Copiar arquivo

source: &Add Instance...
pt_br: &Adicionar instância...

source: &Deployment Types/Instances:
pt_br: Tipos/instâncias &deployment:

source: Mobility Deployment
pt_br: Mobilidade deployment

source: Mo&bility Deployment
pt_br: Mo&bilidade deployment

source: New Deployment Instance
pt_br: Nova instância deployment

source: &Select Deployment Type:
pt_br: &Selecionar tipo deployment:

source: &New Instance Name:
pt_br: &Nova instância de nome:

source: Deployment Instance of this name already exists.
pt_br: Instância deployment deste nome já existe.

source: Deployment Instance name must be a valid Java identifier.
pt_br: Nome da instância deployment deve ser um identificador Java válido.

source: JAM Servlet
pt_br: Servlet JAM

source: Filesystems
pt_br: Sistemas de arquivos

source: Parent directory
pt_br: Diretório pai

source: Property ${app.codename} has to define session name.
pt_br: Propriedade ${app.codename} tem que definir nome da sessão.

source: Property ${src.dir} has to point to the valid source root directory.
pt_br: Propriedade ${src.dir} tem que apontar para código-fonte válido no diretório root.

source: Adding {0} second for debugger timeout
pt_br: Adicionando {0} segundo para tempo de espera do depurador

source: Attached JPDA debugger to {0}:{1}
pt_br: Anexado depurador JPDA para {0}:{1}

source: KdpDebugTask connecting to debugger {0} ..
pt_br: KdpDebugTask conectando para depurador {0} ..

source: Connecting JPDA Debugger to emulator timed out after {0} attempts and {1} seconds.
pt_br: Conectando depurador JPDA para tempo de espera do emulador após {0} tentativas e {1} segundos.

source: Address attribute must specify the debugging port number on localhost.
pt_br: Atributo endereço deve especificar o número da porta do depurador no localhost.

source: Attached JPDA debugger to {0}
pt_br: Aenxado o depurador JPDA para {0}

source: PasswordProperty attribute is required.
pt_br: Atributo propriedade da senha é requerido.

source: Only one of KeyStore, KeyFile, and ConnectionId attributes is allowed.
pt_br: Apenas um atributo do repositório de chaves, arquivo chave e conexão é permitido.

source: UserNameProperty attribute cannot be used when asking for KeyStore or KeyFile password.
pt_br: Atributo propriedade do nome do usuário não pode ser usado quando perguntar pela senha do repositório ou chave do arquivo.

source: KeyStore, KeyFile, or ConnectionId attribute is required.
pt_br: Atributo repositório de chave, arquivo chave ou conexão é requerido.

source: Enter password cancelled.
pt_br: Informar senha cancelada.

source: KeyStore file does not exist.
pt_br: Arquivo repositório de chave não existe.

source: Mobility Licensing
pt_br: Licenciamento de mobilidade

source: Mobility Licensing module.
pt_br: Módulo de licenciamento de mobilidade.

source: NetBeans Moblity Pack License Agreement
pt_br: Contrato de licença NetBeans Moblity Pack

source: Please read the following license agreement carefully.
pt_br: Favor ler o contrato de licença a seguir com cautela.

source: If you accept all terms of the agreement, click I Accept to continue loading NetBeans Mobility Pack modules.
pt_br: Se voce aceitar todos os termos do contrato, clique Aceito para continuar carregando os módulos NetBeans Mobility Pack.

source: You must accept the agreement prior to use NetBeans Mobility Pack.
pt_br: Voce deve aceitar primeiro o contrato para usar o NetBeans Mobility Pack.

source: I &Accept
pt_br: &Aceito

source: &Reject
pt_br: &Rejeito

source: License Panel
pt_br: Painel de licença

source: License Dialog
pt_br: Diálogo de licença

source: License Agreement
pt_br: Contrato de licença

source: License Text
pt_br: Texto da licença

source: Accept Button
pt_br: Botão Aceitar

source: Click to accept license and continue
pt_br: Clique para aceitar a licença e continuar

source: Reject Button
pt_br: Botão Rejeitar

source: Click to reject license and exit
pt_br: Clique para rejeitar a licença e sair

source: NetBeans Mobility Pack License Agreement was rejected by user.
pt_br: Contrato de licença do NetBeans Mobility Pack foi rejeitado pelo usuário.

source: Supports Java ME CDC Projects, such as for mobile client-side Java.
pt_br: Suporta projetos CDC Java ME, como Java Móvel do lado-cliente.

source: Support for Java ME CDC Projects.
pt_br: Suporte para projetos para CDC Java ME.

source: A CDC project can compile a Java source root, build a JAR from it, run JUnit-based tests, create Javadoc, and run or debug an application with a main class.
pt_br: Um projeto CDC pode compilar um código-fonte Java root, construir um JAR dele, executar testes baseado em JUnit, criar Javadoc, e executar ou depurar uma aplicação com uma classe principal.

source: Class "{0}" does not have a main method.
pt_br: Classe "{0}" não tem um método principal.

source: The project has not build script.
pt_br: O projeto não contrói script.

source: This directory is removed when the project is cleaned:
pt_br: Este diretório é removido quando o projeto é limpo:

source: Put all native components to this directory:
pt_br: Colocar todos componentes nativo neste diretório:

source: Put all resources which should not be in jar file here.
pt_br: Colocar todos recursos que não esteja aqui no arquivo JAR.

source: They will be handled per target platform
pt_br: Eles serão manuseados pela plataforma de destino

source: Space-separated list of JVM arguments used when running the project
pt_br: Lista de espaço separado de argumentos JVM usado ao executar projeto

source: (you may also define separate properties like run-sys-prop.name=value instead of -Dname=value
pt_br: (voce pode também definir propriedades separadas como run-sys-prop.name=value ao invés de -Dname=value

source: or test-sys-prop.name=value to set system properties for unit tests):
pt_br: ou test-sys-prop.name=value para configurar propriedades do sistema para testes de unidade):

source: Only compile against the classpath explicitly listed here:
pt_br: Compilar somente do caminho de classe listado explicitamente aqui:

source: Space-separated list of extra javac options
pt_br: Lista extra de espaço-separado de opções javac

source: Test Packages
pt_br: Pacotes de teste

source: <html><b>Project Needs Upgrading</b></html> This project was created in an earlier version of NetBeans IDE.
pt_br: <html><b>Projeto precisa de atualização</b></html> Este projeto foi criado em uma versão anterior do IDE NetBeans.

source: If you edit its properties in NetBeans IDE {0}, the project will be upgraded and <html><b>will no longer work in earlier versions of the IDE or Sun Java Toolkit 1.0.</b></html>
pt_br: Se você editar as propriedades do projeto no IDE NetBeans {0}, o projeto será atualizado e <html><b>não funcionará mais em versões anteriores do IDE ou kit de ferramenta Java da Sun 1.0.</b></html>

source: You have an option to copy the project to the new location and upgrade it there or upgrade your project in current location.
pt_br: Voce tem uma opção para copiar o projeto para uma nova localização e atualizá-lo lá ou atualizar seu projeto na localização atual.

source: Change Project Properties
pt_br: Mudar propriedades do projeto

source: &Upgrade Project
pt_br: &Atualizar projeto

source: &Copy and Upgrade Project
pt_br: &Copiar e aualizar projeto

source: Upgrade project
pt_br: Atualizar projeto

source: Copy and Upgrade Project
pt_br: Copiar e atualizar projeto

source: Java ME CDC Project Ant Extensions
pt_br: Extensões do projeto Ant CDC Java ME

source: Run File
pt_br: Executar projeto

source: Debug File
pt_br: Depurar arquivo

source: Test Project
pt_br: Testar projeto

source: Debug Test Project
pt_br: Depurar teste de projeto

source: Broken Platform Reference
pt_br: Referência de plataforma quebrada

source: <html><p><strong>The project {0} has a broken platform reference.</strong></p><br><p> You have to fix the broken reference and invoke the action again.</p>
pt_br: <html><p><strong>O projeto {0} tem uma referência de plataforma quebrada.</strong></p><br><p> Voce tem que corrigir a referência quebrada e invocar a ação outra vez.</p>

source: CDC Build System Ant Utilities
pt_br: Construir utilitários do sistema Ant CDC

source: Personal Profile Xlet Form
pt_br: Formulário profile pessoal Xlet

source: AGUI Xlet Form
pt_br: Formulário AGUI Xlet

source: CrEme JFrame Form
pt_br: Formulário CrEme JFrame

source: CDC General
pt_br: CDC Geral

source: CDC Run
pt_br: Executar CDC

source: Manage &Emulators...
pt_br: Gerenciar &emuladores...

source: No CDC platform available.
pt_br: Nenhuma plataforma CDC disponível.

source: Application &Name:
pt_br: &Nome da aplicação:

source: Application &Vendor:
pt_br: &Fornecedor da aplicação:

source: De&scription:
pt_br: De&scrição:

source: Detail &Description:
pt_br: &Descrição do detalhe:

source: &Use Values from "Default Configuration"
pt_br: &Utilizar valores de "Configuração padrão"

source: Main C&lass:
pt_br: C&lass principal:

source: &Arguments:
pt_br: &Argumentos:

source: &Classpath for Running Project:
pt_br: &Classpath para execução de projeto:

source: &Working Directory:
pt_br: Diretório de &trabalho:

source: Brow&se...
pt_br: Navega&dor...

source: Browse Working Directory
pt_br: Navegador de diretório de trabalho

source: &VM Options:
pt_br: Opções &VM:

source: (e.g. -Xms10m)
pt_br: (ex.: -Xms10m)

source: Execution Type:
pt_br: Tipo de execução:

source: No execution.
pt_br: Nenhuma execução.

source: Run using main(String[] args) method.
pt_br: Executar usando método main(String[] args).

source: Run using Xlet execution.
pt_br: Executar usando execução Xlet.

source: Run using multiple Xlet execution.
pt_br: Executar usando execução múltipla Xlet.

source: Run using Applet execution.
pt_br: Executar usando execução Applet.

source: main(String args[]) method execution
pt_br: Execução do método main(String args[])

source: Xlet execution
pt_br: Execução Xlet

source: Applet execution
pt_br: Execução Applet

source: &Select the main class:
pt_br: &Selecionar a classe main:

source: &Main classes:
pt_br: Classes &main:

source: Select Main Class
pt_br: Selecionar classe main

source: Browse Main Classes
pt_br: Procurar classes main

source: <No main classes found>
pt_br: <Nenhuma classe main encontrada>

source: Project {0} does not have a main class set.
pt_br: Projeto {0} não tem uma classe main definida.

source: {0} class wasn''t found in {1} project.
pt_br: Classe {0} não foi encontrada no projeto {1}.

source: &Run using main(String[] args) method execution
pt_br: &Executar usando o método de execução main(String[] args)

source: Run using &Xlet execution
pt_br: Executar usando execução &Xlet

source: Run using &Applet execution
pt_br: Executar usando execução &Applet

source: Allow &execution of multiple Xlets
pt_br: Permitir &execução de múltiplas Xlets

source: Initializing view, please wait ...
pt_br: Inicializando visualização, por favor aguarde...

source: Tests can be only run using main(String[] args) method execution!
pt_br: Testes podem ser apenas executados usando métodos de execução main(String[] args) !

source: Run using main(String[] args) method execution
pt_br: Executar usando método de execução main(String[] args)

source: Run using Xlet execution
pt_br: Executar usando execução Xlet

source: Run using Applet execution
pt_br: Executar usando execução Applet

source: Allow execution of multiple Xlets
pt_br: Permitir execução de múltiplas Xlets

source: Main classes
pt_br: Classes main

source: VM Options
pt_br: Opções VM

source: Arguments
pt_br: Argumentos

source: Main Class
pt_br: Classe main

source: Browse
pt_br: Procurar

source: Shows thumbnail.
pt_br: Exibe miniatura.

source: Thumbnail
pt_br: Miniatura

source: Image Objects
pt_br: Objetos de imagem

source: Creates a new xlet.
pt_br: Criar uma nova xlet.

source: The xlet application programming model is very similar to the applet application programming model.
pt_br: O modelo de programação de aplicação xlet é muito similar ao modelo de programação de aplicação applet.

source: Xlets are loaded into an xlet manager and controlled through a life cycle interface.
pt_br: Xlets são carregadas dentro de um gerenciador xlet e controlado através de uma interface de ciclo de vida.

source: This is similar to how an applet is loaded and run inside a browser.
pt_br: Isto é similar como um applet que é carregado e executado de dentro de um navegador.

source: The main difference is that the xlet application programming model does not have implicit API requirements like java.applet which allows it to be used in a greater variety of product scenarios.
pt_br: A principal diferença é que o modelo de programação de aplicação não ter implícito requerimentos de API como java.applet o qual permite ser usado em uma maior variedade de produção de cenários.

source: Note: This template contains form code that allows you to design the xlet visually in the Form Editor.
pt_br: Nota: Este modelo contem código de formulário que permite voce desenhar a xlet visualmente no editor de formulário.

source: Imports an existing Java CDC application into a free-form IDE project.
pt_br: Importa uma aplicação CDC Java existente dentro de um projeto IDE de formulário livre.

source: A free-form project uses your existing Ant build script to run, compile, and debug your project.
pt_br: Um projeto de formulário livre usa seu script de construção Ant existente para executar, compilar e depurar seu projeto.

source: Creates a new CDC library in a standard IDE project.
pt_br: Cria uma nova biblioteca CDC em um projeto IDE padrão.

source: A CDC library does not contain a main class.
pt_br: Uma biblioteca CDC não contem uma classe principal.

source: Standard projects use an IDE-generated Ant build script to build, run, and debug your project.
pt_br: Projetos padrão usam um script de construção de IDE-gerada Ant para construir, executar e depurar seu projeto.

source: Creates a new CDC application in a standard IDE project.
pt_br: Cria uma nova aplicação CDC em um projeto IDE padrão.

source: You can also generate a main class in the project.
pt_br: Voce pode também gerar uma classe principal no projeto.

source: Note: This template does not contain form code that allows you to design the xlet visually in the Form Editor.
pt_br: Nota: Este modelo não contem código de formulário que permita voce desenhar a xlet visualmente no editor de formulário.

source: For visual design, start with the Xlet template under Java GUI Forms.
pt_br: Para desenho visual, iniciar com o modelo de Xlet embaixo do formulário GUI Java.

source: Imports an existing CDC Toolkit project into a Netbeans 6.0 IDE project.
pt_br: Importa um projeto de kit de ferramenta CDC existente para dentro de um projeto IDE Netbeans 6.0.

source: This project uses an IDE-generated Ant build script and special tasks to preprocess, build, obfuscate, preverify, run, debug, and deploy your application in the CDC environment.
pt_br: Este projeto usa um script de construção IDE-gerada Ant e tarefas especiais para pré-processar, construir, obfuscar, pré-verificar, executar, depurar e implantar sua aplicação em um ambiente CDC.

source: Source files are referenced from the original project
pt_br: Arquivos de código-fonte são referenciados do projeto original.

source: Creates a new JFC (Swing) Frame for CDC devices.
pt_br: Cria um novo quadro JFC (Swing) para dispositivos CDC.

source: Frames are typically used as standalone top-level windows as the main user interface to the application.
pt_br: Quadros são tipicamente usados como janelas de nível de topo como uma interface de usuário principal para a plicação.

source: Most Swing applications are built starting from this form.
pt_br: Mais aplicações swing são construídas iniciando deste formulário.

source: Imports an existing CDC Pack 5.5 project into a Netbeans 6.0 IDE project.
pt_br: Importa um projeto CDC Pack 5.5 exsitente para dentro de um projeto IDE Netbeans 6.0.

source: Imports an existing CDC application into a standard IDE project.
pt_br: Importa uma aplicação CDC existente para dentro de um projeto IDE padrão.

source: The CDC application can have multiple source folders.
pt_br: A aplicação CDC pode ter múltiplas pastas de código-fonte.

source: CDC Application
pt_br: Aplicação CDC

source: CDC Class Library
pt_br: Biblioteca de classe CDC

source: Import CDC Pack 5.5 Project
pt_br: Importar projeto CDC Pack 5.5

source: Import CDC Toolkit Project
pt_br: Importar projeto de kit de ferramenta CDC

source: newProject
pt_br: novoProjeto

source: CDC Project with Existing Sources
pt_br: Projeto CDC com códigos-fonte existente

source: Creates new CDC Application project
pt_br: Cria novo projeto de aplicação CDC
